#### DividedPathMeasurementType Enumeration

---

|  |
| --- |
| See Also |

DividedPath measurement type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum DividedPathMeasurementType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DividedPathMeasurementType ``` |

| Visual C++ |
| --- |
| ``` public enum class DividedPathMeasurementType ``` |

# Members

| Member name | Description |
| --- | --- |
| ChordLength | Distances between two points are measured along a straight line between the points. |
| SegmentLength | Distances between two points are measured along the path segment between the points. |

# See Also

Autodesk.Revit.DB Namespace